docs: update readme & design blueprint
